import {T_Component} from "src/modules/types.ts";

export const ComponentMocks:T_Component[] = [
    {
        id: 1,
        name: "Титановый шаробалонн",
        status: 1,
        image: "",
        description: "В августе 2018 года было сообщено, что первая товарная партия титановых шаробаллонов (ТШБ) для ракет-носителей «Ангара» отправлена с Воронежского механического завода (ВМЗ) в ПО «Полёт». Это первый комплект ТШБ российского производства: до 2014 года для российских ракет-носителей их поставлял завод «Южмаш» (Украина).",
        price: 100000,
        category: "Дополнительные запчасти"
    },
    {
        id: 2,
        name: "Разгонный блок 'Бриз-М'",
        status: 1,
        image: "",
        description: "В качестве верхней ступени предусмотрено применение разгонных блоков: «Бриз-КМ», «Бриз-М», кислородно-водородный среднего класса (КВСК) и кислородно-водородный тяжёлого класса (КВТК).",
        price: 200000,
        category: "Разгонные блоки"
    },
    {
        id: 3,
        name: "Центральная вычислительная машина 'Бисер-6'",
        status: 1,
        image: "",
        description: "«Бисер-6» предназначен для управления движением и бортовыми системами, а также для контроля полёта и формирования телеметрической информации. При решении задач навигации и наведения с помощью «Бисера-6» выполняются арифметические и логические операции, а также операции обмена информацией с внешними абонентами.",
        price: 300000,
        category: "Электроника"
    },
    {
        id: 4,
        name: "Боковой ракетный модуль - урм 1",
        status: 1,
        image: "",
        description: "Описание",
        price: 400000,
        category: "Универсальные ракетные модули"
    }
]